app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    render json: Game.all, status: :ok

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    game = Game.find(params[:id])

SELECT "games".* FROM "games" ORDER BY "games"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "games" ("id", "winner", "game_state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 61], ["winner", "X"], ["game_state", "{\"\",\"\",X,\"\",X,O,X,O,\"\"}"], ["created_at", "2024-12-06 21:30:06.961163"], ["updated_at", "2024-12-06 21:30:06.961163"]]
---
  def create
    last_game = Game.order(:id).last
    next_id = last_game ? last_game.id + 1 : 1
    game = Game.create(id: next_id, winner: game_params[:winner], game_state: game_params[:game_state])

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = $1  [["id", 55]]
---
  def destroy
    game = Game.find(params[:id])
    game.destroy

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def reset
    game = Game.find(params[:id])

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show_game_state
    game = Game.find(params[:id])

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "games" SET "winner" = $1, "game_state" = $2, "updated_at" = $3 WHERE "games"."id" = $4  [["winner", "O"], ["game_state", "{X,O,X,\"\",O,X,\"\",O,\"\"}"], ["updated_at", "2024-12-09 14:43:01.380273"], ["id", 66]]
---
  def update
    game = Game.find(params[:id])
    if game.update(game_params)

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def check_win
    game = Game.find(params[:id])