app/controllers/games_controller.rb

SELECT "games".* FROM "games" ORDER BY "games"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "games" ("id", "winner", "game_state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 92], ["winner", "X"], ["game_state", "{\"\",O,X,\"\",O,X,\"\",\"\",X}"], ["created_at", "2024-12-13 19:00:35.218044"], ["updated_at", "2024-12-13 19:00:35.218044"]]
---
  def create
    last_game = Game.order(:id).last
    next_id = last_game ? last_game.id + 1 : 1
    game = Game.new(id: next_id, winner: game_params[:winner], game_state: game_params[:game_state])

    if game.save

DELETE FROM "games" WHERE "games"."id" = $1  [["id", 92]]
---
  def destroy
    game = Game.find(params[:id])
    game.destroy